In [17]:
test_semantic_model_url = 'https://raw.githubusercontent.com/djouallah/semantic_sql_testing/refs/heads/main/semantic_model.txt' 
questions_url           = 'https://raw.githubusercontent.com/djouallah/semantic_sql_testing/refs/heads/main/questions.json'
SF                      = 0.1
max_attempts            = 2
TIMEOUT_SECONDS         = 180  
output_dir              = "/tmp/llm"
model1                  = "o3-mini"
model2                  = "qwen3:30b-a3b"

In [18]:
import requests
import json
import duckdb
import pathlib
import time
import re
from   openai import AzureOpenAI, OpenAIError
import datetime
import os
import threading
import pandas as pd

# Generate Data

In [19]:
if SF <1 :
 schema = f"DS{str(SF).replace('.', '_')}"
else :
 schema = f'DS{SF:02d}'
os.makedirs(output_dir, exist_ok=True)
db_path = output_dir +"/"+ schema +".duckdb"
if not pathlib.Path(db_path).exists():
    con = duckdb.connect(db_path)
    con.sql("SET memory_limit = '14GB' ")
    con.sql(f"CALL dsdgen(sf={SF})")
    con.close()
con = duckdb.connect()
con.sql(f""" attach '{db_path}' as ds(read_only) ; use ds """)
timestamp = datetime.datetime.now().strftime("%Y%m%d_%H%M%S")

# Run Tests

In [20]:
def get_ai_response(user_message, LLM, provider, api_key=None, azure_endpoint=None, azure_api_version=None):
    system_prompt = ""
    try:
        github_response = requests.get(test_semantic_model_url)
        github_response.raise_for_status()
        system_prompt = github_response.text.strip()
    except requests.RequestException as e:
        print(f"Error fetching system prompt from GitHub ({test_semantic_model_url}): {e}")
        return f"Error fetching system prompt: {e}"

    generated_text = None
    data = None

    if provider == "ollama":
        url = 'http://127.0.0.1:11434/api/chat'
        headers = {'Content-Type': 'application/json'}
        payload = {
            'model': LLM,
            'messages': [
                {'role': 'system', 'content': system_prompt},
                {'role': 'user', 'content': user_message}
            ],
            'stream': False
        }
        try:
            response = requests.post(url, headers=headers, json=payload)
            response.raise_for_status()
            data = response.json()
            generated_text = data.get('message', {}).get('content', '')
            if generated_text:
                generated_text = generated_text.replace("<think>", "").replace("</think>", "")
        except requests.RequestException as e:
            return f"Error with Ollama API request: {e}"
        except (KeyError, IndexError, AttributeError) as e:
            return f"Unexpected response format from Ollama: {e}\nFull response data: {data}"

    elif provider == "azure_foundry":
        if not azure_endpoint or not azure_api_version or not api_key:
            return "Azure provider requires 'azure_endpoint', 'azure_api_version', and 'api_key' parameters."

        try:
            client = AzureOpenAI(
                api_version=azure_api_version,
                azure_endpoint=azure_endpoint,
                api_key=api_key,
            )

            response = client.chat.completions.create(
                messages=[
                    {"role": "system", "content": system_prompt},
                    {"role": "user", "content": user_message}
                ],
                model=LLM,
            )

            generated_text = response.choices[0].message.content

        except Exception as e:
            return f"An error occurred with Azure OpenAI: {e}"



    else:
        return f"Unsupported provider for this test setup: {provider}. Supported providers are 'ollama', 'azure_foundry', and 'gemini'."

    if not isinstance(generated_text, str):
         print(f"Generated text is not a string (type: {type(generated_text)}). Cannot clean.")
         if generated_text is None:
              return "Could not retrieve generated text from provider response."
         else:
              return f"Received unexpected output type from {provider}: {type(generated_text)}. Value: {generated_text}"


    cleaned_text = re.sub(r'```(sql|duckdb)?\s*([\s\S]*?)\s*```', r'\2', generated_text, flags=re.IGNORECASE).strip()

    if "```" in cleaned_text or "SELECT " in cleaned_text.upper() or "WITH " in cleaned_text.upper():
         cleaned_text = cleaned_text.replace("```sql", "").replace("```duckdb", "").replace("```", "").strip()


    return cleaned_text

In [21]:
def execute_sql_with_retry(query, test_model, provider, api_key, azure_endpoint, azure_api_version):
    attempt = 1
    current_query = query.strip()

    while attempt <= max_attempts:
        con.sql("SET enable_progress_bar_print = false")
        con.sql("SET progress_bar_time = 0")

        result_container = {"result": None, "error": None}

        def query_thread():
            try:
                result_container["result"] = con.execute(current_query).fetchdf()
            except duckdb.InterruptException:
                result_container["error"] = f"Query interrupted after timeout of {TIMEOUT_SECONDS} seconds."
            except Exception as e:
                result_container["error"] = str(e)

        thread = threading.Thread(target=query_thread)
        thread.start()

        start_time = time.time()
        while thread.is_alive():
            elapsed = time.time() - start_time
            if elapsed > TIMEOUT_SECONDS:
                con.interrupt()
                thread.join()
                return f"Query execution timed out after {TIMEOUT_SECONDS} seconds.", attempt, "query runs forever"
            time.sleep(0.1)

        if result_container["error"]:
            error_message = result_container["error"].lower()
            if "syntax" not in error_message and "parser" not in error_message and "binder" not in error_message:
                return f"Non-syntax error: {result_container['error']}", attempt, current_query

            print(current_query)
            print(f"Attempt {attempt}/{max_attempts} failed with syntax error: {result_container['error']}")

            if attempt == max_attempts:
                return f"Max attempts reached. Last error: {result_container['error']}", attempt, current_query

            message = (
                f"The following SQL query has a syntax error: '{current_query}'.\n"
                f"Error message: {result_container['error']}\n"
                f"Please provide the corrected SQL query. Return only the corrected query without explanation."
            )

            corrected_query = get_ai_response(message, test_model, provider, api_key, azure_endpoint, azure_api_version)

            if corrected_query.startswith("Error"):
                return f"Failed to get corrected query : {corrected_query}", attempt, current_query

            current_query = corrected_query.strip()
            attempt += 1
        else:
            return result_container["result"], attempt, current_query

    return "Unexpected error or loop termination", attempt, current_query

In [22]:
def ask_question(questions, test_model,provider,api_key=None, azure_endpoint=None, azure_api_version=None):
    results_data = [] 
    for i, x in enumerate(questions):
        print(f"Question {i+1}: {x}") # Keep or remove print as needed
        start_time = time.time()
        sql_query_or_error = get_ai_response(x, test_model, provider, api_key, azure_endpoint, azure_api_version)
        print(sql_query_or_error) # Keep or remove print as needed
        query_result_data_json = [] # Initialize as an empty list for JSON result
        attempts_count = None
        error_details = None # Initialize error_details
        if sql_query_or_error is None or sql_query_or_error.startswith("Error"):
            # If get_ai_response returned an error or None, store the error string
            error_message = sql_query_or_error if sql_query_or_error is not None else "AI response was None"
            # print(f"Failed to get query from AI: {error_message}") # Keep or remove print
            # print("Execution: SKIPPED (AI error)") # Keep or remove print
            error_details = f"AI Error: {error_message}" # Store error details
            # query_result_data_json remains empty []
            result_row_count = 0 # Result count is 0 on error
        else:
            result_from_execution, attempts_count,query_returned = execute_sql_with_retry(sql_query_or_error, test_model,provider,api_key, azure_endpoint, azure_api_version)

            display(result_from_execution)
            is_successful = isinstance(result_from_execution, pd.DataFrame)

            if is_successful:
                print("Execution: SUCCESS") # Keep or remove print
                query_result_data_json = result_from_execution.to_dict('records')
                error_details = None # No error details on success
                result_row_count = len(result_from_execution) # Calculate row count
            else:
                print("Execution: FAILED") # Keep or remove print
                #query_result_data_json remains empty []
                error_details = f"Execution Error: {result_from_execution}" # Store error details
                result_row_count = 0 # Result count is 0 on failure


        end_time = time.time()
        duration = round(end_time - start_time, 2)
        print(f"\nExecution Time: {duration:.2f} seconds") # Keep or remove print
        print(f" ############################### ") # Keep or remove print
        results_data.append({
            "model" : test_model,
            "SF" : SF,
            "timestamp": timestamp,
            "nbr": i + 1,
            "question": x,
            "duration_s": duration, 
            "sql_query": query_returned, 
            "attempts": attempts_count,
            "result": query_result_data_json, 
            "result_count": result_row_count, 
            "error_details": error_details 
        })
    log_dir = output_dir +"/log"
    os.makedirs(log_dir, exist_ok=True)
    sanitized_model = re.sub(r'[\\/*?:"<>|]', '_', test_model)
    output_filename = f"{timestamp}_{sanitized_model}.json"
    output_path = os.path.join(log_dir, output_filename)
    try:
        with open(output_path, 'w', encoding='utf-8') as f:
            json.dump(results_data, f, indent=4)
            f.flush()
            os.fsync(f.fileno())
        return f"Successfully processed {len(questions)} questions. Results saved to {output_path}"
    except IOError as e:
        return f"Error saving results to {output_path}: {e}"
    except Exception as e:
        return f"An unexpected error occurred during file saving: {e}"

In [23]:
def display_side_by_side(nbr, model1, model2):
    print(f"question {nbr} : " + duckdb.sql(f" select question from results_filtered where nbr = {nbr}  ").fetchone()[0])
    try:
        df1 = con.sql(duckdb.sql(f""" select sql_query from results_filtered where nbr = {nbr} and model = '{model1}' """).fetchone()[0]).df()        
        df2 = con.sql(duckdb.sql(f""" select sql_query from results_filtered where nbr = {nbr} and model = '{model2}' """).fetchone()[0]).df() 
        side_by_side = pd.concat([df1, df2], axis=1, keys=[model1, model2])
        display(side_by_side)
    except Exception as e:
        print(f"Error executing query for nbr {nbr}: {e}")

In [24]:
# get the questions from GitHub
try:
    response = requests.get(questions_url)
    response.raise_for_status()  # Raise an exception for HTTP errors (4xx or 5xx)
    questions = json.loads(response.text)

    print("Successfully retrieved questions:")
except requests.exceptions.RequestException as e:
    print(f"Error retrieving file from GitHub: {e}")
except json.JSONDecodeError as e:
    print(f"Error decoding JSON: {e}")

Successfully retrieved questions:

In [25]:
%%time
#ask_question(questions,"o3-mini","azure_foundry",os.getenv("o3_mini_key"), os.getenv("llm_endpoint"),"2025-01-01-preview" )

CPU times: total: 0 ns
Wall time: 0 ns

In [26]:
%%time
#ask_question(questions,model2,"ollama")

CPU times: total: 0 ns
Wall time: 0 ns

# Check Results

In [27]:
duckdb.sql(f""" select *,
           cardinality(result[1]) as nbr_columns,
            [result_count , nbr_columns] as result_shape,
            hash(flatten(array_transform(result, x -> json_extract(json(x), '$.*'))) )  as output
            from read_json_auto('{output_dir}/log/*.json') where model in ('{model1}','{model2}') and SF = '{SF}' """).to_view("results")
try:
 duckdb.sql(f""" install excel ; load excel ;copy results to '{output_dir}/test.xlsx' (format 'xlsx', header 'true', overwrite)  """)
except Exception as e:
    print(f"Error exporting to Excel: {e}")
    print("close the excel file or tey again.")
# check number of rows and column returned by each model, Null means SQL error
duckdb.sql(f""" 
           with zzzz as (select nbr,question,model,output , timestamp from results )
           pivot( select nbr,model,count(distinct(output)) as result_shape , count(distinct(timestamp)) as nbr_runs from zzzz group by all) 
           on model using min(result_shape) as resultsets ,min(nbr_runs) as nbr_runs order by nbr
        """).show(max_width=120)

Error exporting to Excel: IO Error: Could not move file: The process cannot access the file because it is being used by another process.

close the excel file or tey again.
┌───────┬────────────────────┬──────────────────┬──────────────────────────┬────────────────────────┐
│  nbr  │ o3-mini_resultsets │ o3-mini_nbr_runs │ qwen3:30b-a3b_resultsets │ qwen3:30b-a3b_nbr_runs │
│ int64 │       int64        │      int64       │          int64           │         int64          │
├───────┼────────────────────┼──────────────────┼──────────────────────────┼────────────────────────┤
│     1 │                  1 │                5 │                        1 │                      6 │
│     2 │                  1 │                5 │                        1 │                      6 │
│     3 │                  1 │                5 │                        1 │                      6 │
│     4 │                  1 │                5 │                        1 │                      6 │
│     5 │                  1 │                5 │                        3 │                      6 │
│     6 │                  1 │                5 │                        1 │                      6 │
│     7 │                  1 │                5 │                        1 │                      6 │
│     8 │                  1 │                5 │                        1 │                      6 │
│     9 │                  1 │                5 │                        2 │                      6 │
│    10 │                  1 │                5 │                        1 │                      6 │
│    11 │                  1 │                5 │                        1 │                      6 │
│    12 │                  3 │                5 │                        2 │                      6 │
│    13 │                  2 │                5 │                        1 │                      6 │
│    14 │                  2 │                5 │                        1 │                      6 │
│    15 │                  1 │                5 │                        3 │                      6 │
│    16 │                  5 │                5 │                        4 │                      6 │
│    17 │                  5 │                5 │                        3 │                      6 │
│    18 │                  4 │                5 │                        2 │                      6 │
│    19 │                  1 │                5 │                        5 │                      6 │
│    20 │                  1 │                5 │                        1 │                      6 │
├───────┴────────────────────┴──────────────────┴──────────────────────────┴────────────────────────┤
│ 20 rows                                                                                 5 columns │
└───────────────────────────────────────────────────────────────────────────────────────────────────┘

Check different results for the same Question and Models

In [28]:
Model_to_use = model2

In [29]:
df = duckdb.sql(f"""
    with xxx as (
        select nbr, output, timestamp
        from results
        where model = '{Model_to_use}'
        qualify count(distinct output) over(partition by nbr) > 1
        order by nbr
    )
    select nbr, output, min(timestamp) as timestamp
    from xxx
    group by all
    order by nbr
""").df()

# Iterate through each unique nbr
for nbr in df['nbr'].unique():
    # Print the question for the current nbr
    question = duckdb.sql(f"select question from results where nbr = {nbr}").fetchone()[0]
    print(f"Question {nbr}: {question}")
    
    # Get the timestamps and outputs for the current nbr from the query
    nbr_rows = df[df['nbr'] == nbr][['output', 'timestamp']].sort_values(by='timestamp', ascending=False)
    
    # Collect DataFrames for each timestamp
    dfs = []
    labels = []
    for _, row in nbr_rows.iterrows():
        timestamp = row['timestamp']
        try:
            # Get the SQL query for the given nbr, model, and timestamp
            sql_query = duckdb.sql(f"""
                select sql_query
                from results
                where nbr = {nbr}
                and model = '{Model_to_use}'
                and timestamp = '{timestamp}'
            """).fetchone()[0]
            
            # Execute the SQL query and convert to DataFrame
            df_temp = con.sql(sql_query).df()
            dfs.append(df_temp)
            labels.append(f"Timestamp: {timestamp}")
        except Exception as e:
            print(f"Error executing query for nbr {nbr}, timestamp {timestamp}: {e}")
    
    # Display DataFrames side by side
    if dfs:
        try:
            # Concatenate DataFrames horizontally
            combined_df = pd.concat(dfs, axis=1, keys=labels)
            display(combined_df)
        except Exception as e:
            print(f"Error combining DataFrames for nbr {nbr}: {e}")
    else:
        print(f"No valid DataFrames to display for nbr {nbr}")

Question 5: What are the different item categories available? Order alphabetically by category name.

,Timestamp: 20250513_135916,Timestamp: 20250513_114023,Timestamp: 20250512_190159
,category_name,item_category,item_category
0,Home,Men,Books
1,Electronics,Home,Children
2,Jewelry,Electronics,Electronics
3,Men,Children,Home
4,Sports,Music,Jewelry
5,Books,Women,Men
6,None,Sports,Music
7,Shoes,Books,Shoes
8,Music,None,Sports
9,Women,Jewelry,Women
10,Children,Shoes,None

Question 9: Compare total sales from preferred customers versus non-preferred customers, ordered by total sales

  Timestamp: 20250512_193907               Timestamp: 20250512_190159  \
               customer_type   total_sales      c_preferred_cust_flag
0              Non-Preferred  2.461229e+08                          N
1                  Preferred  2.456942e+08                          Y
2                    Unknown  1.625229e+07                       None


    total_sales
0  2.461229e+08
1  2.456942e+08
2  1.625229e+07

Question 12: Calculate the return rate for each item category, ordered alphabetically by item category name.

   Timestamp: 20250512_193907                                         \
                item_category  total_sales total_returns return_rate
0                       Books  56231614.81    2903525.42    5.163511
1                    Children  48923440.85    2398817.12    4.903206
2                 Electronics  56084975.64    2918402.71    5.203537
3                        Home  48874282.69    2501742.06    5.118729
4                     Jewelry  52983266.97    2714389.19    5.123106
5                         Men  50692116.25    2702402.68    5.331012
6                       Music  52783919.32    2827889.58    5.357483
7                       Shoes  47807842.49    2459773.92    5.145126
8                      Sports  43870221.97    2320822.09    5.290199
9                       Women  54383250.42    2853326.02    5.246700
10                       None         0.00     105709.98         NaN
11                       None   1665936.31          0.00    0.000000

   Timestamp: 20250512_190159
                item_category   total_sales total_returns return_rate
0                       Books  1.151889e+09  5.991503e+08   52.014571
1                    Children  1.002764e+09  4.972227e+08   49.585214
2                 Electronics  1.131998e+09  5.944267e+08   52.511276
3                        Home  9.428043e+08  4.850939e+08   51.452236
4                     Jewelry  1.124985e+09  5.817695e+08   51.713516
5                         Men  9.710632e+08  5.231980e+08   53.878882
6                       Music  1.083239e+09  5.711324e+08   52.724498
7                       Shoes  8.565552e+08  4.506496e+08   52.611856
8                      Sports  8.597793e+08  4.583328e+08   53.308190
9                       Women  1.121840e+09  5.959801e+08   53.125237
10                       None  4.275175e+07  2.817335e+07   65.899883
11                        NaN           NaN           NaN         NaN

Question 15: List all item product names that have a return rate greater than 5% and their total sales, ordered by item product name alphabetically.

     Timestamp: 20250512_201025                                        \
              item_product_name total_sales total_returns return_rate
0                          able   317464.60      18242.98    5.746461
1                      ableable   262437.05      18697.28    7.124482
2                  ableableable   114399.12      12521.80   10.945714
3                  ableableeing   132341.75      15900.80   12.014954
4              ableableeseought   113558.93       6742.09    5.937085
...                         ...         ...           ...         ...
1787                        NaN         NaN           NaN         NaN
1788                        NaN         NaN           NaN         NaN
1789                        NaN         NaN           NaN         NaN
1790                        NaN         NaN           NaN         NaN
1791                        NaN         NaN           NaN         NaN

     Timestamp: 20250512_193907                          \
              item_product_name total_sales return_rate
0                          able   317464.60    5.746461
1                      ableable   262437.05    7.124482
2                  ableableable   114399.12   10.945714
3                  ableableeing   132341.75   12.014954
4              ableableeseought   113558.93    5.937085
...                         ...         ...         ...
1787                        NaN         NaN         NaN
1788                        NaN         NaN         NaN
1789                        NaN         NaN         NaN
1790                        NaN         NaN         NaN
1791                        NaN         NaN         NaN

     Timestamp: 20250512_190159
                 i_product_name  total_sales return_rate
0                          able   6984221.20   47.538906
1                      ableable   4461429.85   61.186726
2                  ableableable    686394.72  131.348563
3             ableableableought   1831976.44   66.887318
4                  ableableanti    898426.69   29.218843
...                         ...          ...         ...
1787                pripriought  12705804.96   56.146924
1788           priprioughtought   2195162.04   37.478509
1789                  pripripri   2473726.08   48.833365
1790             pripripriought  20018612.08   47.685281
1791                       None   3312253.79   53.383828

[1792 rows x 10 columns]

Question 16: For each store, what was the percentage change in net sales between two consecutive recent years (e.g., 2001 and 2002), ordered alphabetically by store name.
Error executing query for nbr 16, timestamp 20250512_190159: Binder Error: Referenced column "rn" not found in FROM clause!
Candidate bindings: "net_sales", "store_name"

  Timestamp: 20250512_221139                                         \
                  store_name current_year_sales previous_year_sales
0                      ought         -1343830.4         94602708.88
1                        NaN                NaN                 NaN
2                        NaN                NaN                 NaN
3                        NaN                NaN                 NaN
4                        NaN                NaN                 NaN

                    Timestamp: 20250512_201025                                \
  percentage_change                 store_name net_sales_2001 net_sales_2002
0       -101.420499                      ought            0.0    99648652.49
1               NaN                        NaN            NaN            NaN
2               NaN                        NaN            NaN            NaN
3               NaN                        NaN            NaN            NaN
4               NaN                        NaN            NaN            NaN

                    Timestamp: 20250512_193907                              \
  percentage_change               s_store_name year1 year2 net_sales_year1
0               0.0                      ought  2001  2002             NaN
1               NaN                      ought  1998  1999             NaN
2               NaN                      ought  2002  2003     99648652.49
3               NaN                      ought  2000  2001             NaN
4               NaN                      ought  1999  2000             NaN


  net_sales_year2 percentage_change
0     99648652.49               NaN
1             NaN               NaN
2             NaN               NaN
3             NaN               NaN
4             NaN               NaN

Question 17: What is the return rate for items sold on weekends versus weekdays, broken down by customer age groups (e.g., under 30, 30-45, over 45), ordered by age group.

  Timestamp: 20250513_114023                                            \
          customer_age_group sale_day_type   total_sales total_returns
0                      30-45       Weekday  8.222361e+07    4280256.91
1                      30-45       Weekend  3.225223e+07    1553206.42
2                    Over 45       Weekday  1.565045e+08    8147779.85
3                    Over 45       Weekend  6.436525e+07    3224625.39
4                   Under 30       Weekday  1.096806e+08    5516920.95
5                   Under 30       Weekend  4.428833e+07    2325349.37

              Timestamp: 20250512_201025                                       \
  return_rate                  age_group day_type   total_sales total_returns
0    5.205630                      30-45  Weekday  8.222361e+07    4280256.91
1    4.815810                      30-45  Weekend  3.225223e+07    1553206.42
2    5.206100                    Over 45  Weekday  1.565045e+08    8147779.85
3    5.009885                    Over 45  Weekend  6.436525e+07    3224625.39
4    5.029986                   Under 30  Weekend  4.428833e+07    2325349.37
5    5.250479                   Under 30  Weekday  1.096806e+08    5516920.95

              Timestamp: 20250512_190159                                   \
  return_rate              sale_day_type customer_age_group   total_sales
0    5.205630                    Weekday              30-45  8.222361e+07
1    4.815810                    Weekend              30-45  3.225223e+07
2    5.206100                    Weekday            Over 45  1.565045e+08
3    5.009885                    Weekend            Over 45  6.436525e+07
4    5.250479                    Weekday           Under 30  1.096806e+08
5    5.029986                    Weekend           Under 30  4.428833e+07


  total_returns return_rate
0    4280256.91    5.205630
1    1553206.42    4.815810
2    8147779.85    5.206100
3    3224625.39    5.009885
4    5516920.95    5.029986
5    2325349.37    5.250479

Question 18: Which item brand has shown the largest decrease in its return rate when comparing the average rate of 2001 to 2002, specifically for stores located in the 'TN' state? (Order by the decrease in return rate descending, and then by brand name alphabetically for ties).

    Timestamp: 20250512_193907                                    \
                       i_brand return_rate_2001 return_rate_2002
0         exportiunivamalg #12        21.075982         0.000000
1           brandunivamalg #11        15.292578         0.000000
2         exportiamalgamalg #5        13.916474         0.843750
3          exportiunivamalg #3        18.199075         6.369521
4            maxiunivamalg #15        10.735027         0.000000
..                         ...              ...              ...
375                        NaN              NaN              NaN
376                        NaN              NaN              NaN
377                        NaN              NaN              NaN
378                        NaN              NaN              NaN
379                        NaN              NaN              NaN

                         Timestamp: 20250512_190159                   \
    return_rate_decrease                      brand return_rate_2001
0              21.075982       exportiunivamalg #12        21.075982
1              15.292578         brandunivamalg #11        15.292578
2              13.072724       exportiamalgamalg #5        13.916474
3              11.829555        exportiunivamalg #3        18.199075
4              10.735027          maxiunivamalg #15        10.735027
..                   ...                        ...              ...
375                  NaN           edu packbrand #6         2.603178
376                  NaN      importoamalgamalg #11         0.000000
377                  NaN           edu packbrand #7         0.000000
378                  NaN         amalgunivamalg #10         2.136076
379                  NaN         corpamalgamalg #16         0.000000


    return_rate_2002 decrease_in_return_rate
0           0.000000               21.075982
1           0.000000               15.292578
2           0.843750               13.072724
3           6.369521               11.829555
4           0.000000               10.735027
..               ...                     ...
375        14.637866              -12.034688
376        12.267339              -12.267339
377        12.906471              -12.906471
378        15.408743              -13.272667
379        13.579079              -13.579079

[380 rows x 8 columns]

Question 19: For each item class, compare the average net sales value per sales transaction between preferred and non-preferred customers. Order by average net sales descending, and then by item class name alphabetically for ties.

    Timestamp: 20250513_114023                              \
                    item_class customer_type avg_net_sales
0                      country             N       -247.39
1                       accent             N           NaN
2                       accent             Y           NaN
3                       accent          None           NaN
4                  accessories          None           NaN
..                         ...           ...           ...
295               womens watch          None           NaN
296               womens watch             Y           NaN
297                       None             N           NaN
298                       None          None           NaN
299                       None             Y           NaN

    Timestamp: 20250512_221139                                   \
                    item_class preferred_customer avg_net_sales
0                      country                  N       -247.39
1                       accent                  N           NaN
2                       accent                  Y           NaN
3                       accent               None           NaN
4                  accessories               None           NaN
..                         ...                ...           ...
295               womens watch               None           NaN
296               womens watch                  Y           NaN
297                       None                  N           NaN
298                       None               None           NaN
299                       None                  Y           NaN

    Timestamp: 20250512_201025                                   \
                    item_class preferred_customer avg_net_sales
0                      country                  N       -247.39
1                       accent                  N           NaN
2                       accent                  Y           NaN
3                       accent               None           NaN
4                  accessories               None           NaN
..                         ...                ...           ...
295               womens watch                  N           NaN
296               womens watch                  Y           NaN
297                       None               None           NaN
298                       None                  N           NaN
299                       None                  Y           NaN

    Timestamp: 20250512_193907                             \
                    item_class is_preferred avg_net_sales
0                      country            N       -247.39
1                       accent            N           NaN
2                       accent            Y           NaN
3                       accent         None           NaN
4                  accessories            N           NaN
..                         ...          ...           ...
295               womens watch            N           NaN
296               womens watch            Y           NaN
297                       None         None           NaN
298                       None            N           NaN
299                       None            Y           NaN

    Timestamp: 20250512_190159                     \
                    item_class preferred_customer
0                      earings               None
1                       custom               None
2                     monitors               None
3                         None               None
4                    self-help               None
..                         ...                ...
295                 mattresses               None
296                   business               None
297                     hockey               None
298                   wireless               None
299                       arts               None


    avg_net_sales_per_transaction
0                     2704.606949
1                     2406.147636
2                     2272.177463
3                     2270.826970
4                     2269.849091
..                            ...
295                   1457.595789
296                   1400.701803
297                   1355.539697
298                   1340.844182
299                   1167.643191

[300 rows x 15 columns]

Compare the two Models

In [30]:
duckdb.sql(f""" 
        create or replace temp table results_filtered as
           from results  where model = '{model1}' and timestamp = (select max(timestamp) from results where model = '{model1}') 
           union all 
           from results  where model = '{model2}' and timestamp = (select max(timestamp) from results where model = '{model2}')
""")
# execusion time in seconds
duckdb.sql(f""" 
           pivot( select nbr as question ,model,result_shape , attempts from results_filtered ) 
           on model using min(result_shape) as result,  min(attempts) as attempts order by question
        """).show(max_width=130)

┌──────────┬────────────────┬──────────────────┬──────────────────────┬────────────────────────┐
│ question │ o3-mini_result │ o3-mini_attempts │ qwen3:30b-a3b_result │ qwen3:30b-a3b_attempts │
│  int64   │    int128[]    │      int64       │       int128[]       │         int64          │
├──────────┼────────────────┼──────────────────┼──────────────────────┼────────────────────────┤
│        1 │ [1, 1]         │                1 │ [1, 1]               │                      1 │
│        2 │ [1, 1]         │                1 │ [1, 1]               │                      1 │
│        3 │ [1, 1]         │                1 │ [1, 1]               │                      1 │
│        4 │ [1, 1]         │                1 │ [1, 1]               │                      1 │
│        5 │ [11, 1]        │                1 │ [11, 1]              │                      1 │
│        6 │ [6, 2]         │                1 │ [6, 2]               │                      1 │
│        7 │ [1, 2]         │                1 │ [1, 2]               │                      1 │
│        8 │ [518, 2]       │                1 │ [518, 2]             │                      1 │
│        9 │ [3, 2]         │                1 │ [3, 2]               │                      1 │
│       10 │ [1, 2]         │                1 │ [1, 2]               │                      1 │
│       11 │ [1, 2]         │                1 │ [1, 2]               │                      1 │
│       12 │ [12, 2]        │                1 │ [12, 4]              │                      1 │
│       13 │ [12, 2]        │                1 │ [12, 2]              │                      1 │
│       14 │ [213, 2]       │                1 │ [213, 4]             │                      1 │
│       15 │ [865, 2]       │                1 │ [865, 3]             │                      1 │
│       16 │ [1, 4]         │                1 │ [0, NULL]            │                      1 │
│       17 │ [6, 5]         │                1 │ [6, 5]               │                      1 │
│       18 │ [212, 4]       │                1 │ [380, 4]             │                      1 │
│       19 │ [300, 3]       │                1 │ [300, 3]             │                      1 │
│       20 │ [1, 4]         │                1 │ [1, 4]               │                      1 │
├──────────┴────────────────┴──────────────────┴──────────────────────┴────────────────────────┤
│ 20 rows                                                                            5 columns │
└──────────────────────────────────────────────────────────────────────────────────────────────┘

In [31]:
different_results = duckdb.sql(f"""
    SELECT 
        distinct(nbr) 
    FROM results_filtered 
    WHERE nbr in
    (
    select nbr from results_filtered 
    group by all
    having count(distinct(output)) >  1 
    )
    order by nbr
""").df()['nbr'].tolist()
print(f"Different results for {len(different_results)} questions: {different_results}")
good_results = list(set(list(range(1, 21))) - set(different_results))
print(f"Exact resultsets for {len(good_results)} questions: {good_results}")

Different results for 8 questions: [5, 12, 14, 15, 16, 17, 18, 19]
Exact resultsets for 12 questions: [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 13, 20]

In [32]:
for nbr in list(range(1, 21)):
    display_side_by_side(nbr, model1, model2)

question 1 : What is the overall total sales revenue?

        o3-mini qwen3:30b-a3b
    total_sales   total_sales
0  5.143009e+08  5.143009e+08

question 2 : What is the total number of items sold across all transactions?

         o3-mini  qwen3:30b-a3b
  total_quantity total_quantity
0     13939520.0     13939520.0

question 3 : What is the total monetary value of all returned items?

        o3-mini qwen3:30b-a3b
  total_returns total_returns
0   26706800.77   26706800.77

question 4 : List the names of all stores, order by store name.

       o3-mini qwen3:30b-a3b
  s_store_name  s_store_name
0        ought         ought

question 5 : What are the different item categories available? Order alphabetically by category name.

        o3-mini qwen3:30b-a3b
       category category_name
0         Books       Jewelry
1      Children         Women
2   Electronics        Sports
3          Home         Books
4       Jewelry          None
5           Men         Shoes
6         Music      Children
7         Shoes           Men
8        Sports         Music
9         Women          Home
10         None   Electronics

question 6 : Show total sales revenue for each year, ordered chronologically by year.

  o3-mini                     qwen3:30b-a3b
   d_year total_sales_revenue          year   total_sales
0    1998        1.022972e+08          1998  1.022972e+08
1    1999        9.937045e+07          1999  9.937045e+07
2    2000        1.031840e+08          2000  1.031840e+08
3    2001        1.021729e+08          2001  1.021729e+08
4    2002        1.002891e+08          2002  1.002891e+08
5    2003        8.737749e+05          2003  8.737749e+05

question 7 : Which store generated the most total sales revenue? (To ensure a deterministic result if there's a tie, you might order by revenue descending and then store name alphabetically).

       o3-mini               qwen3:30b-a3b
  s_store_name   total_sales  s_store_name   total_sales
0        ought  5.079412e+08         ought  5.079412e+08

question 8 : What is the total quantity of items sold, broken down by item brand? Order by quantity sold descending, and then by brand name alphabetically for ties.

                o3-mini                      qwen3:30b-a3b
                  brand total_quantity          item_brand total_quantity
0     exportischolar #2       329402.0   exportischolar #2       329402.0
1    edu packimporto #2       279745.0  edu packimporto #2       279745.0
2       amalgexporti #2       256831.0     amalgexporti #2       256831.0
3     importoimporto #2       251018.0   importoimporto #2       251018.0
4       importoamalg #2       244138.0     importoamalg #2       244138.0
..                  ...            ...                 ...            ...
513        univbrand #1         2468.0        univbrand #1         2468.0
514  corpamalgamalg #17         2457.0  corpamalgamalg #17         2457.0
515     exportibrand #9         2391.0     exportibrand #9         2391.0
516   univamalgamalg #7         2264.0   univamalgamalg #7         2264.0
517     edu packmaxi #1         2027.0     edu packmaxi #1         2027.0

[518 rows x 4 columns]

question 9 : Compare total sales from preferred customers versus non-preferred customers, ordered by total sales

                o3-mini                       qwen3:30b-a3b
  c_preferred_cust_flag   total_sales c_preferred_cust_flag   total_sales
0                     N  2.461229e+08                     N  2.461229e+08
1                     Y  2.456942e+08                     Y  2.456942e+08
2                  None  1.625229e+07                  None  1.625229e+07

question 10 : What is the total return amount for each city where stores are located, ordered alphabetically by city name.

  o3-mini               qwen3:30b-a3b
     city total_returns          city total_returns
0  Midway   26153478.62        Midway   26153478.62

question 11 : What is the net sales for each store name, order by net sales.

     o3-mini              qwen3:30b-a3b
  store_name    net_sales    store_name    net_sales
0      ought  481787676.8         ought  481787676.8

question 12 : Calculate the return rate for each item category, ordered alphabetically by item category name.

         o3-mini             qwen3:30b-a3b                             \
   item_category return_rate item_category  total_sales total_returns
0          Books    5.163511         Books  56231614.81    2903525.42
1       Children    4.903206      Children  48923440.85    2398817.12
2    Electronics    5.203537   Electronics  56084975.64    2918402.71
3           Home    5.118729          Home  48874282.69    2501742.06
4        Jewelry    5.123106       Jewelry  52983266.97    2714389.19
5            Men    5.331012           Men  50692116.25    2702402.68
6          Music    5.357483         Music  52783919.32    2827889.58
7          Shoes    5.145126         Shoes  47807842.49    2459773.92
8         Sports    5.290199        Sports  43870221.97    2320822.09
9          Women    5.246700         Women  54383250.42    2853326.02
10          None    0.000000          None   1665936.31          0.00
11          None         NaN          None         0.00     105709.98


   return_rate
0     5.163511
1     4.903206
2     5.203537
3     5.118729
4     5.123106
5     5.331012
6     5.357483
7     5.145126
8     5.290199
9     5.246700
10    0.000000
11         NaN

question 13 : What is the monthly trend of net sales during the year 2001, order by net sales desc

   o3-mini              qwen3:30b-a3b
     month    net_sales         month    net_sales
0       12  17167258.39            12  17167258.39
1       11  16207294.58            11  16207294.58
2        9  11365462.90             9  11365462.90
3       10  10717099.39            10  10717099.39
4        8  10489886.43             8  10489886.43
5        1   5177088.03             1   5177088.03
6        5   4686864.37             5   4686864.37
7        3   4436523.60             3   4436523.60
8        7   4418270.78             7   4418270.78
9        4   4336369.48             4   4336369.48
10       2   4033130.36             2   4033130.36
11       6   3909591.47             6   3909591.47

question 14 : Which customer birth country exhibits the highest average return rate Order by average return rate descending ? show only the country and the return rate

              o3-mini                      qwen3:30b-a3b               \
      c_birth_country return_rate customer_birth_country  total_sales
0    MARSHALL ISLANDS    8.010773       MARSHALL ISLANDS   1764016.13
1              BELIZE    7.248808                 BELIZE   2748711.88
2         EL SALVADOR    7.092067            EL SALVADOR   2311820.88
3       LIECHTENSTEIN    7.089155          LIECHTENSTEIN   1948101.68
4              SWEDEN    6.939946                 SWEDEN   2171519.99
..                ...         ...                    ...          ...
208            ISRAEL    3.518910                 ISRAEL   2417400.74
209           ROMANIA    3.389739                ROMANIA   1969824.05
210            BRAZIL    3.223556                 BRAZIL   1040436.35
211              None    0.000000                   None  17383211.00
212              None         NaN                   None         0.00


    total_returns return_rate
0       141311.33    8.010773
1       199248.86    7.248808
2       163955.88    7.092067
3       138103.94    7.089155
4       150702.31    6.939946
..            ...         ...
208      85066.16    3.518910
209      66771.90    3.389739
210      33539.05    3.223556
211          0.00    0.000000
212     853685.56         NaN

[213 rows x 6 columns]

question 15 : List all item product names that have a return rate greater than 5% and their total sales, ordered by item product name alphabetically.

              o3-mini                 qwen3:30b-a3b
       i_product_name total_sales item_product_name total_sales return_rate
0                able   317464.60              able   317464.60    5.746461
1            ableable   262437.05          ableable   262437.05    7.124482
2        ableableable   114399.12      ableableable   114399.12   10.945714
3        ableableeing   132341.75      ableableeing   132341.75   12.014954
4    ableableeseought   113558.93  ableableeseought   113558.93    5.937085
..                ...         ...               ...         ...         ...
860       pripriation   604846.13       pripriation   604846.13    7.979446
861    pripribarought   502711.61    pripribarought   502711.61    6.602762
862       priprically   199231.61       priprically   199231.61    7.009942
863  pripricallyought   564620.56  pripricallyought   564620.56    5.656588
864    priprieseought   197315.89    priprieseought   197315.89    6.957539

[865 rows x 5 columns]

question 16 : For each store, what was the percentage change in net sales between two consecutive recent years (e.g., 2001 and 2002), ordered alphabetically by store name.

     o3-mini                                           qwen3:30b-a3b  \
  store_name previous_year current_year percent_change    store_name
0      ought          2002         2003    -101.420499           NaN


  year1_sales year2_sales percentage_change
0         NaN         NaN               NaN

question 17 : What is the return rate for items sold on weekends versus weekdays, broken down by customer age groups (e.g., under 30, 30-45, over 45), ordered by age group.

        o3-mini                                                             \
  sale_day_type customer_age_group   total_sales total_returns return_rate
0       Weekday              30-45  8.222361e+07    4280256.91    5.205630
1       Weekend              30-45  3.225223e+07    1553206.42    4.815810
2       Weekday            Over 45  1.675552e+08    8755435.52    5.225405
3       Weekend            Over 45  6.903643e+07    3424849.43    4.960931
4       Weekday           Under 30  1.096806e+08    5516920.95    5.029986
5       Weekend           Under 30  4.428833e+07    2325349.37    5.250479

       qwen3:30b-a3b
  customer_age_group sale_day_type   total_sales total_returns return_rate
0              30-45       Weekday  8.222361e+07    4280256.91    5.205630
1              30-45       Weekend  3.225223e+07    1553206.42    4.815810
2            Over 45       Weekday  1.565045e+08    8147779.85    5.206100
3            Over 45       Weekend  6.436525e+07    3224625.39    5.009885
4           Under 30       Weekday  1.096806e+08    5516920.95    5.029986
5           Under 30       Weekend  4.428833e+07    2325349.37    5.250479

question 18 : Which item brand has shown the largest decrease in its return rate when comparing the average rate of 2001 to 2002, specifically for stores located in the 'TN' state? (Order by the decrease in return rate descending, and then by brand name alphabetically for ties).

                  o3-mini                                    \
                  i_brand return_rate_2001 return_rate_2002
0    exportiamalgamalg #5        13.916474         0.843750
1     exportiunivamalg #3        18.199075         6.369521
2       maxiunivamalg #13         9.189426         1.439496
3        corpunivamalg #7         8.067342         0.487251
4          scholarmaxi #8         7.526645         0.476072
..                    ...              ...              ...
375                   NaN              NaN              NaN
376                   NaN              NaN              NaN
377                   NaN              NaN              NaN
378                   NaN              NaN              NaN
379                   NaN              NaN              NaN

                                     qwen3:30b-a3b                   \
    decrease_in_return_rate                i_brand return_rate_2001
0                 13.072724   exportiunivamalg #12        21.075982
1                 11.829555     brandunivamalg #11        15.292578
2                  7.749930   exportiamalgamalg #5        13.916474
3                  7.580091    exportiunivamalg #3        18.199075
4                  7.050572      maxiunivamalg #15        10.735027
..                      ...                    ...              ...
375                     NaN       edu packbrand #6         2.603178
376                     NaN  importoamalgamalg #11         0.000000
377                     NaN       edu packbrand #7         0.000000
378                     NaN     amalgunivamalg #10         2.136076
379                     NaN     corpamalgamalg #16         0.000000


    return_rate_2002 decrease_in_return_rate
0           0.000000               21.075982
1           0.000000               15.292578
2           0.843750               13.072724
3           6.369521               11.829555
4           0.000000               10.735027
..               ...                     ...
375        14.637866              -12.034688
376        12.267339              -12.267339
377        12.906471              -12.906471
378        15.408743              -13.272667
379        13.579079              -13.579079

[380 rows x 8 columns]

question 19 : For each item class, compare the average net sales value per sales transaction between preferred and non-preferred customers. Order by average net sales descending, and then by item class name alphabetically for ties.

            o3-mini                                     qwen3:30b-a3b  \
            i_class c_preferred_cust_flag avg_net_sales    item_class
0           earings                  None   2532.885873       earings
1            custom                  None   2363.180714        custom
2          monitors                  None   2272.177463      monitors
3         self-help                  None   2269.849091          None
4    entertainments                  None   2174.550328     self-help
..              ...                   ...           ...           ...
295        business                  None   1378.109839    mattresses
296        wireless                  None   1293.797018      business
297     consignment                  None   1272.868095        hockey
298          hockey                  None   1225.556438      wireless
299            arts                  None   1143.317292          arts


    preferred_customer avg_net_sales_per_transaction
0                 None                   2704.606949
1                 None                   2406.147636
2                 None                   2272.177463
3                 None                   2270.826970
4                 None                   2269.849091
..                 ...                           ...
295               None                   1457.595789
296               None                   1400.701803
297               None                   1355.539697
298               None                   1340.844182
299               None                   1167.643191

[300 rows x 6 columns]

question 20 : show all stores net sales , average net sales and percentage of net sales compared to average net sales for each store, ordered by percentage of net sales descending.

       o3-mini                                       qwen3:30b-a3b  \
  s_store_name    net_sales avg_net_sales pct_vs_avg    store_name
0        ought  481787676.8   481787676.8      100.0         ought


     net_sales avg_net_sales percentage_of_avg_net_sales
0  481787676.8   481787676.8                       100.0